const mockingCourses = [
    ["001", "计算机组成", "12", "60", "200", "6", "核心专业"],
    ["002", "数据库理论", "34", "198", "200", "3", "一般专业"],
    ["003", "编译原理", "56", "34", "150", "3", "核心专业"],
    ["004", "算法导论", "78", "122", "100", "2", "核心专业"],
    ["005", "操作系统", "45", "5", "50", "4", "核心专业"],
    ["006", "面向对象", "78", "12", "240", "5", "核心专业"],
].map(e => ({
    Id: e[0],
    Name: e[1],
    Time: e[2],
    Person: e[3],
    Capacity: e[4],
    Score: e[5],
    Type: e[6],
}));
export default mockingCourses;