import {IRepoMess} from "../../Components/Repository/interface";

const mockingRepoMessages:IRepoMess[] = [
    ["001", "购入100箱苹果", "2", "IN", "100", "1", "4267138719"],
    ["002", "卖出50箱西瓜", "2", "OUT", "50", "2", "9712034961"],
    ["003", "欠货10台iPad", "2", "OUT", "1", "3", "5479321354"],
    ["004", "围巾原料", "1", "OUT", "100", "4", "7393058184"],
    ["005", "员工用水杯", "2", "IN", "120", "5", "1040185931"],
    ["006", "碎纸机一批", "3", "IN", "20", "6", "5516031932"],
    ["007", "叉车10辆", "1", "IN", "15", "7", "5132495733"],
    ["008", "500箱纸巾", "3", "IN", "3000", "8", "1349526736"],
    ["009", "一批计算机", "2", "IN", "10", "9", "1946514383"],
    ["010", "30桶原油", "2", "IN", "15", "10", "1234548932"],
    ["011", "1辆货车", "2", "OUT", "100", "11", "9876347693"],
    ["012", "积木玩具一批共400箱", "2", "IN", "400", "12", "5287411304"]
].map(e => ({
    repo_mess_id: e[0],
    repo_mess_info: e[1],
    repo_id: e[2],
    direction: e[3],
    quantity: e[4],
    prod_id: e[5],
    order_id: e[6],
}));
export default mockingRepoMessages;