import {IOrder} from "../../Components/Repository/interface";

const mockingOrders: IOrder[] = [
    ["4267138719", "20190204", "1", "1", "购入100箱苹果的订单"],
    ["9712034961", "20180207", "1", "5", "卖出50箱西瓜的订单"],
    ["5479321354", "20190228", "2", "5", "欠货10台iPad的订单"],
    ["7393058184", "20180930", "1", "4", "围巾原料的订单"],
    ["1040185931", "20190201", "4", "1", "员工用水杯的订单"],
    ["5516031932", "20190303", "1", "3", "碎纸机一批的订单"],
    ["5132495733", "20180103", "2", "1", "叉车10辆的订单"],
    ["1349526736", "20180315", "1", "2", "500箱纸巾的订单"],
    ["1946514383", "20190213", "1", "1", "一批计算机的订单"],
    ["1234548932", "20180224", "3", "2", "30桶原油的订单"],
    ["9876347693", "20191219", "3", "3", "1辆货车的订单"],
    ["5287411304", "20191020", "3", "2", "积木玩具一批共400箱的订单"]
].map(e => ({
    order_id: e[0],
    order_date: e[1],
    cust_id: e[2],
    state: e[3],
    order_info:e[4]
}));
export default mockingOrders;